freshev/micropython/ports/esp32/modcc1101.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2025 freshev
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "py/runtime.h"
#include "py/stream.h"
#include "py/mphal.h"
// #include "extmod/machine_spi.h"
#include "modmachine.h"

#include "driver/spi_master.h"
//#include "components/esp_hw_support/include/esp_private/spi_share_hw_ctrl.h"
#include "esp_private/spi_share_hw_ctrl.h"
#include "hal/spi_hal.h"
#include "driver/gpio.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_pins.h"

// SPI mappings by device, naming used by IDF old/new
// upython   | ESP32     | ESP32S2   | ESP32S3 | ESP32C3
// ----------+-----------+-----------+---------+---------
// SPI(id=1) | HSPI/SPI2 | FSPI/SPI2 | SPI2    | SPI2
// SPI(id=2) | VSPI/SPI3 | HSPI/SPI3 | SPI3    | err

// Number of available hardware SPI peripherals.
#if SOC_SPI_PERIPH_NUM > 2
#define MICROPY_HW_SPI_MAX (2)
#else
#define MICROPY_HW_SPI_MAX (1)
#endif

// Default pins for SPI(id=1) aka IDF SPI2, can be overridden by a board
#ifndef MICROPY_HW_SPI1_SCK
// Use IO_MUX pins by default.
// If SPI lines are routed to other pins through GPIO matrix
// routing adds some delay and lower limit applies to SPI clk freq
#define MICROPY_HW_SPI1_SCK SPI2_IOMUX_PIN_NUM_CLK // pin 12
#define MICROPY_HW_SPI1_CS   SPI2_IOMUX_PIN_NUM_CS  // pin 10
#define MICROPY_HW_SPI1_MOSI SPI2_IOMUX_PIN_NUM_MOSI // pin 11
#define MICROPY_HW_SPI1_MISO SPI2_IOMUX_PIN_NUM_MISO // pin 13
#endif

// Default pins for SPI(id=2) aka IDF SPI3, can be overridden by a board
#ifndef MICROPY_HW_SPI2_SCK
#if CONFIG_IDF_TARGET_ESP32
// ESP32 has IO_MUX pins for VSPI/SPI3 lines, use them as defaults
#define MICROPY_HW_SPI2_SCK SPI3_IOMUX_PIN_NUM_CLK      // pin 18
#define MICROPY_HW_SPI2_CS  SPI3_IOMUX_PIN_NUM_CS       // pin 5
#define MICROPY_HW_SPI2_MOSI SPI3_IOMUX_PIN_NUM_MOSI    // pin 23
#define MICROPY_HW_SPI2_MISO SPI3_IOMUX_PIN_NUM_MISO    // pin 19
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
// ESP32S2 and S3 uses GPIO matrix for SPI3 pins, no IO_MUX possible
// Set defaults to the pins used by SPI2 in Octal mode
#define MICROPY_HW_SPI2_SCK (36)
#define MICROPY_HW_SPI2_MOSI (35)
#define MICROPY_HW_SPI2_MISO (37)
#endif
#endif

#define MP_HW_SPI_MAX_XFER_BYTES (4092)
#define MP_HW_SPI_MAX_XFER_BITS (MP_HW_SPI_MAX_XFER_BYTES * 8) // Has to be an even multiple of 8


#define   WRITE_BURST       0x40 // write burst mask
#define   READ_SINGLE       0x80 // read single mask
#define   READ_BURST        0xC0 // read burst mask
#define   BYTES_IN_RXFIFO   0x7F // byte number in RXfifo
#define   max_modul 6

#define CC1101_IOCFG2       0x00 // GDO2 output pin configuration
#define CC1101_IOCFG1       0x01 // GDO1 output pin configuration
#define CC1101_IOCFG0       0x02 // GDO0 output pin configuration
#define CC1101_FIFOTHR      0x03 // RX FIFO and TX FIFO thresholds
#define CC1101_SYNC1        0x04 // Sync word, high byte
#define CC1101_SYNC0        0x05 // Sync word, low byte
#define CC1101_PKTLEN       0x06 // Packet length
#define CC1101_PKTCTRL1     0x07 // Packet automation control 1
#define CC1101_PKTCTRL0     0x08 // Packet automation control 0
#define CC1101_ADDR         0x09 // Device address
#define CC1101_CHANNR       0x0A // Channel number
#define CC1101_FSCTRL1      0x0B // Frequency synthesizer control 1
#define CC1101_FSCTRL0      0x0C // Frequency synthesizer control 2
#define CC1101_FREQ2        0x0D // Frequency control word, high byte
#define CC1101_FREQ1        0x0E // Frequency control word, middle byte
#define CC1101_FREQ0        0x0F // Frequency control word, low byte
#define CC1101_MDMCFG4      0x10 // Modem configuration 4
#define CC1101_MDMCFG3      0x11 // Modem configuration 3
#define CC1101_MDMCFG2      0x12 // Modem configuration 2
#define CC1101_MDMCFG1      0x13 // Modem configuration 1
#define CC1101_MDMCFG0      0x14 // Modem configuration 0
#define CC1101_DEVIATN      0x15 // Modem deviation setting
#define CC1101_MCSM2        0x16 // Main Radio Control State Machine configuration 2
#define CC1101_MCSM1        0x17 // Main Radio Control State Machine configuration 1
#define CC1101_MCSM0        0x18 // Main Radio Control State Machine configuration 0
#define CC1101_FOCCFG       0x19 // Frequency Offset Compensation configuration
#define CC1101_BSCFG        0x1A // Bit Synchronization configuration
#define CC1101_AGCCTRL2     0x1B // AGC control 2
#define CC1101_AGCCTRL1     0x1C // AGC control 1
#define CC1101_AGCCTRL0     0x1D // AGC control 0
#define CC1101_WOREVT1      0x1E // High byte Event 0 timeout
#define CC1101_WOREVT0      0x1F // Low byte Event 0 timeout
#define CC1101_WORCTRL      0x20 // Wake On Radio control
#define CC1101_FREND1       0x21 // Front end RX configuration 1
#define CC1101_FREND0       0x22 // Front end TX configuration 0
#define CC1101_FSCAL3       0x23 // Frequency synthesizer calibration 3
#define CC1101_FSCAL2       0x24 // Frequency synthesizer calibration 2
#define CC1101_FSCAL1       0x25 // Frequency synthesizer calibration 1
#define CC1101_FSCAL0       0x26 // Frequency synthesizer calibration 0
#define CC1101_RCCTRL1      0x27 // RC oscillator configuration 1
#define CC1101_RCCTRL0      0x28 // RC oscillator configuration 0
#define CC1101_FSTEST       0x29 // Frequency synthesizer calibration control
#define CC1101_PTEST        0x2A // Production test
#define CC1101_AGCTEST      0x2B // AGC test
#define CC1101_TEST2        0x2C // Various test settings
#define CC1101_TEST1        0x2D // Various test settings
#define CC1101_TEST0        0x2E // Various test settings

//CC1101 commands
#define CC1101_SRES         0x30        // Reset
#define CC1101_SFSTXON      0x31        // Enable and calibrate frequency synthesizer
#define CC1101_SXOFF        0x32        // Turn off oscillator
#define CC1101_SCAL         0x33        // Calibrate frequency synthesizer and turn it off
#define CC1101_SRX          0x34        // Enter RX state
#define CC1101_STX          0x35        // Enter TX state
#define CC1101_SIDLE        0x36        // Enter Idle state
#define CC1101_SAFC         0x37        // Perform AFC adjustment
#define CC1101_SWOR         0x38        // Start automatic RX polling sequence (Wake-on-Radio)
#define CC1101_SPWD         0x39        // Enter power down state
#define CC1101_SFRX         0x3A        // Flush the RX FIFO buffer.
#define CC1101_SFTX         0x3B        // Flush the TX FIFO buffer.
#define CC1101_SWORRST      0x3C        // Reset real time clock.
#define CC1101_SNOP         0x3D        // No operation

// CC1101 STATUS REGISTER
#define CC1101_PARTNUM      0x30 // Part number
#define CC1101_VERSION      0x31 // Current version number
#define CC1101_FREQEST      0x32 // Frequency Offset Estimate
#define CC1101_LQI          0x33 // Demodulator estimate for Link Quality
#define CC1101_RSSI         0x34 // Received signal strength indication
#define CC1101_MARCSTATE    0x35 // Control state machine state
#define CC1101_WORTIME1     0x36 // High byte of WOR timer
#define CC1101_WORTIME0     0x37 // Low byte of WOR timer
#define CC1101_PKTSTATUS    0x38 // Current GDOx status and packet status
#define CC1101_VCO_VC_DAC   0x39 // Current setting from PLL calibration module
#define CC1101_TXBYTES      0x3A // Underflow and number of bytes in the TX FIFO
#define CC1101_RXBYTES      0x3B // Overflow and number of bytes in the RX FIFO
#define CC1101_RC1_STATUS   0x3C // Last RC oscillator calibration result
#define CC1101_RC0_STATUS   0x3D // Last RC oscillator calibration result

// PATABLE, TXFIFO, RXFIFO
#define CC1101_PATABLE      0x3E
#define CC1101_TXFIFO       0x3F
#define CC1101_RXFIFO       0x3F


