freshev/micropython/ports/esp32/modcc1101.c
// ------------------
// CC1101
// ------------------
typedef struct _cc1101_obj_t {
    mp_obj_base_t base;
    spi_host_device_t host;
    uint32_t freq;
    uint8_t polarity;
    uint8_t phase;
    uint8_t bits;
    uint8_t firstbit;
    int8_t sck;
    int8_t csn;
    int8_t mosi;
    int8_t miso;
    spi_device_handle_t spi;
    enum {
        cc1101_STATE_NONE,
        cc1101_STATE_INIT,
        cc1101_STATE_DEINIT
    } state;

    float MHz;
    int32_t power; // dBm
    uint8_t modulation;
    uint8_t chan;
    uint8_t ccmode;

    uint8_t trxstate;
    uint8_t last_power;
    uint8_t P_TABLE[8];
    uint8_t m4RxBw;
    uint8_t m4DaRa;
    uint8_t m2DCOFF;
    uint8_t m2MODFM;
    uint8_t m2MANCH;
    uint8_t m2SYNCM;

    uint8_t m1FEC;
    uint8_t m1PRE;
    uint8_t m1CHSP;

    uint8_t pc0WDATA;
    uint8_t pc0PktForm;
    uint8_t pc0CRC_EN;
    uint8_t pc0LenConf;
    uint8_t pc1PQT;
    uint8_t pc1CRC_AF;
    uint8_t pc1APP_ST;
    uint8_t pc1ADRCHK;

    uint8_t clb1[2];
    uint8_t clb2[2];
    uint8_t clb3[2];
    uint8_t clb4[2];
    uint8_t debug;

} cc1101_obj_t;

// singleton CC1101 objects
static cc1101_obj_t *cc1101_obj[2] = {NULL, NULL};

uint8_t P_INIT[8]       = {0x00,0xC0,0x00,0x00,0x00,0x00,0x00,0x00};
// power, dBm              -30  -20  -15  -10  0    5    7    10
uint8_t P_TABLE_315[8]  = {0x12,0x0D,0x1C,0x34,0x51,0x85,0xCB,0xC2};           //300 - 348 MHz
// power, dBm              -30  -20  -15  -10  0    5    7    10
uint8_t P_TABLE_433[8]  = {0x12,0x0E,0x1D,0x34,0x60,0x84,0xC8,0xC0};           //387 - 464 MHz
// power, dBm              -30  -20  -15  -10  -6   0    5    7    10   12
uint8_t P_TABLE_868[10] = {0x03,0x17,0x1D,0x26,0x37,0x50,0x86,0xCD,0xC5,0xC0}; //779 - 899.99 MHz
// power, dBm              -30  -20  -15  -10  -6   0    5    7    10   11
uint8_t P_TABLE_915[10] = {0x03,0x0E,0x1E,0x27,0x38,0x8E,0x84,0xCC,0xC3,0xC0,};//900 - 928 MHz

const char * CC1101_WRITE_FAILED = "SPI write failed";
const char * CC1101_READ_FAILED = "SPI read failed";
const char * CC1101_WRITE_BURST_FAILED = "SPI write burst failed";
const char * CC1101_READ_BURST_FAILED = "SPI read burst failed";
const char * CC1101_NOT_OPENED = "SPI NOT opened";
const char * CC1101_MALLOC_FAILED = "SPI memory allocation failed";

// ----------
// Exceptions
// ----------

MP_DEFINE_EXCEPTION(CC1101Error, OSError)

NORETURN void mp_raise_CC1101Error(const char *msg) {
    mp_raise_msg(&mp_type_CC1101Error, MP_ERROR_TEXT(msg));
}

// --------
// Forwards
// --------
void _cc1101_calibrate(cc1101_obj_t * self);
void _cc1101_reset(cc1101_obj_t * self);
void _cc1101_reg_config_settings(cc1101_obj_t * self);
void _cc1101_split_PKTCTRL0(cc1101_obj_t * self);
void _cc1101_split_PKTCTRL1(cc1101_obj_t * self);
void _cc1101_split_MDMCFG1(cc1101_obj_t * self);
void _cc1101_split_MDMCFG2(cc1101_obj_t * self);
void _cc1101_split_MDMCFG4(cc1101_obj_t * self);
uint8_t _cc1101_digital_read_gdo0(cc1101_obj_t * self);
void _cc1101_debug(cc1101_obj_t * self, char * message, ...);
uint8_t _cc1101_map(uint32_t x, uint32_t in_min, uint32_t in_max, uint32_t out_min, uint32_t out_max);

// --------------------
// Internals
// --------------------

static void _cc1101_deinit_internal(cc1101_obj_t *self) {
    switch (spi_bus_remove_device(self->spi)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_CC1101Error("CC1101 invalid configuration (bus_remove_device)");
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_CC1101Error("SPI already closed");
            return;
    }

    switch (spi_bus_free(self->host)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_CC1101Error("CC1101 invalid configuration (bus_free)");
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_CC1101Error("CC1101 invalid state");
            return;
    }

    int8_t pins[4] = {self->miso, self->csn, self->mosi, self->sck};

    for (int i = 0; i < sizeof(pins); i++) {
        if (pins[i] != -1) {
            esp_rom_gpio_pad_select_gpio(pins[i]);
            esp_rom_gpio_connect_out_signal(pins[i], SIG_GPIO_OUT_IDX, false, false);
            gpio_set_direction(pins[i], GPIO_MODE_INPUT);
        }
    }

    self->state = cc1101_STATE_DEINIT;
}

static void _cc1101_init_internal(
    cc1101_obj_t *self,
    int8_t host,
    int32_t freq,
    int8_t polarity,
    int8_t phase,
    int8_t bits,
    int8_t firstbit,
    int8_t sck,
    int8_t csn,
    int8_t mosi,
    int8_t miso) {

    // if we're not initialized, then we're
    // implicitly 'changed', since this is the init routine
    bool changed = self->state != cc1101_STATE_INIT;

    esp_err_t ret;

    cc1101_obj_t old_self = *self;

    if (host != -1 && host != self->host) {
        self->host = host;
        changed = true;
    }

    if (freq != -1) {
        // calculate the actual clock frequency that the SPI peripheral can produce
        freq = spi_get_actual_clock(APB_CLK_FREQ, freq, 0);
        if (freq != self->freq) {
            self->freq = freq;
            changed = true;
        }
    }

    if (polarity != -1 && polarity != self->polarity) {
        self->polarity = polarity;
        changed = true;
    }

    if (phase != -1 && phase != self->phase) {
        self->phase = phase;
        changed = true;
    }

    if (bits != -1 && bits != self->bits) {
        self->bits = bits;
        changed = true;
    }

    if (firstbit != -1 && firstbit != self->firstbit) {
        self->firstbit = firstbit;
        changed = true;
    }

    if (sck != -2 && sck != self->sck) {
        self->sck = sck;
        changed = true;
    }

    if (csn != -1 && csn != self->csn) {
        self->csn = csn;
        changed = true;
    }

    if (mosi != -2 && mosi != self->mosi) {
        self->mosi = mosi;
        changed = true;
    }

    if (miso != -2 && miso != self->miso) {
        self->miso = miso;
        changed = true;
    }

    if (changed) {
        if (self->state == cc1101_STATE_INIT) {
            self->state = cc1101_STATE_DEINIT;
            _cc1101_deinit_internal(&old_self);
        }
    } else {
        return; // no changes
    }

    gpio_reset_pin(self->csn);
    gpio_set_direction(self->csn, GPIO_MODE_OUTPUT);
    gpio_set_level(self->csn, 1);


    spi_bus_config_t buscfg = {
        .miso_io_num = self->miso,
        .mosi_io_num = self->mosi,
        .sclk_io_num = self->sck,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1
    };

