freshev/micropython/ports/esp32/modcc1101.c
    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = self->freq,
        .mode = self->phase | (self->polarity << 1),
        .spics_io_num = self->csn, // -1: No CS pin, was self->csn
        .queue_size = 2, // was 2, 7
        .flags = self->firstbit == MICROPY_PY_MACHINE_SPI_LSB ? SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST : 0,
        //.flags = SPI_DEVICE_NO_DUMMY,
        .pre_cb = NULL
    };

    // Initialize the SPI bus

    // Select DMA channel based on the hardware SPI id
    int dma_chan = 0;
    #if CONFIG_IDF_TARGET_ESP32
    if (self->host == SPI2_HOST) {
        dma_chan = 1;
    } else {
        dma_chan = 2;
    }
    #else
    dma_chan = SPI_DMA_CH_AUTO;
    #endif

    if(spicommon_periph_in_use(self->host)) {
         mp_printf(&mp_plat_print, "trying to free SPI\n");
         //spi_host_t * host = bus_driver_ctx[self->host];
         //spi_device_t * dev = get_acquiring_dev(host);
         //spi_bus_remove_device(dev);
         //spi_bus_remove_device(host->device_acquiring_lock);
         spi_bus_free(self->host);
    }

    ret = spi_bus_initialize(self->host, &buscfg, dma_chan);
    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_CC1101Error("CC1101 invalid configuration (bus_initialize)");
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_CC1101Error("CC1101 SPI ID already in use");
            return;
    }

    ret = spi_bus_add_device(self->host, &devcfg, &self->spi);
    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            spi_bus_free(self->host);
            mp_raise_CC1101Error("CC1101 invalid configuration (bus_add_device)");
            return;

        case ESP_ERR_NO_MEM:
            spi_bus_free(self->host);
            mp_raise_CC1101Error("CC1101 out of memory");
            return;

        case ESP_ERR_NOT_FOUND:
            spi_bus_free(self->host);
            mp_raise_CC1101Error("CC1101 no free slots");
            return;
    }
    self->state = cc1101_STATE_INIT;
}

static mp_uint_t _cc1101_gcd(mp_uint_t x, mp_uint_t y) {
    while (x != y) { if (x > y) x -= y; else y -= x; }
    return x;
}

static void _spi_transfer_main(cc1101_obj_t *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    cc1101_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->state == cc1101_STATE_DEINIT) {
        mp_raise_CC1101Error("CC1101 SPI not opened");
        return;
    }

    // Round to nearest whole set of bits
    int bits_to_send = len * 8 / self->bits * self->bits;

    if (!bits_to_send) {
        mp_raise_CC1101Error("buffer too short");
    }


    if (len <= 0) { // if (len <= 4) {
        spi_transaction_t transaction = { 0 };

        if (src != NULL) {
            memcpy(&transaction.tx_data, src, len);
        }

        transaction.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
        transaction.length = bits_to_send;
        spi_device_transmit(self->spi, &transaction);

        if (dest != NULL) {
            memcpy(dest, &transaction.rx_data, len);
        }
    } else {
        int offset = 0;
        int bits_remaining = bits_to_send;
        int optimum_word_size = 8 * self->bits / _cc1101_gcd(8, self->bits);
        int max_transaction_bits = MP_HW_SPI_MAX_XFER_BITS / optimum_word_size * optimum_word_size;
        spi_transaction_t *transaction, *result, transactions[2];
        int i = 0;

        spi_device_acquire_bus(self->spi, portMAX_DELAY);

        while (bits_remaining) {
            transaction = transactions + i++ % 2;
            memset(transaction, 0, sizeof(spi_transaction_t));

            transaction->length =
                bits_remaining > max_transaction_bits ? max_transaction_bits : bits_remaining;

            if (src != NULL) transaction->tx_buffer = src + offset;
            if (dest != NULL) transaction->rx_buffer = dest + offset;

            spi_device_queue_trans(self->spi, transaction, portMAX_DELAY);
            bits_remaining -= transaction->length;

            if (offset > 0) {
                // wait for previously queued transaction
                MP_THREAD_GIL_EXIT();
                spi_device_get_trans_result(self->spi, &result, portMAX_DELAY);
                MP_THREAD_GIL_ENTER();
            }

            // doesn't need ceil(); loop ends when bits_remaining is 0
            offset += transaction->length / 8;
        }

        // wait for last transaction
        MP_THREAD_GIL_EXIT();
        spi_device_get_trans_result(self->spi, &result, portMAX_DELAY);
        MP_THREAD_GIL_ENTER();
        spi_device_release_bus(self->spi);
    }
}

static uint8_t _spi_transfer_addr(cc1101_obj_t *self_in, uint8_t addr, uint8_t wbyte) {
    uint8_t m_wbyte[2] = {addr, wbyte};
    uint8_t m_rbyte[2] = {0, 0};
    _spi_transfer_main(self_in, 2, m_wbyte, m_rbyte);
    return m_rbyte[1];
}

static uint8_t _spi_transfer(cc1101_obj_t *self_in, uint8_t addr) {
    uint8_t m_wbyte[1] = { addr };
    uint8_t m_rbyte[1] = { 0 };
    _spi_transfer_main(self_in, 1, m_wbyte, m_rbyte);
    return m_rbyte[0];
}


void _spi_transfer_addr_burst(cc1101_obj_t *self_in, uint8_t addr, uint8_t* wbuffer,  uint8_t* rbuffer, uint32_t length) {
    uint8_t* m_wbuffer = malloc(length + 1);
    uint8_t* m_rbuffer = malloc(length + 1);
    if(m_wbuffer != NULL && m_rbuffer != NULL) {
        *m_wbuffer = addr;
        memcpy(m_wbuffer + 1, wbuffer, length);
        _spi_transfer_main(self_in, length + 1, m_wbuffer, m_rbuffer);
        memset(rbuffer, 0, length);
        memcpy(rbuffer, m_rbuffer + 1, length);
        free(m_rbuffer);
        free(m_wbuffer);
    } else mp_raise_CC1101Error(CC1101_MALLOC_FAILED);
}


// -----------
// Constructor
// -----------

mp_obj_t cc1101_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_id, ARG_freq, ARG_sck, ARG_csn, ARG_mosi, ARG_miso, ARG_debug };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_id,       MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_freq,     MP_ARG_INT, {.u_int = 10000000} },
        { MP_QSTR_sck,      MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_csn,      MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_mosi,     MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_miso,     MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_debug,    MP_ARG_INT, {.u_int = 0} },
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t temp_id = 0;
    switch (args[ARG_id].u_int) {
        case 1: temp_id = 1; break;
        case 2: temp_id = 2; break;
        default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown 'CC1101 SPI ID' argument value")); return mp_const_none;
    }

    cc1101_obj_t *self = NULL;
    if(cc1101_obj[temp_id - 1] == NULL) {
        // self = m_new_obj_with_finaliser(cc1101_obj_t);
        self = m_new_obj(cc1101_obj_t);
        self->host = temp_id;
        cc1101_obj[temp_id - 1] = self;
    } else self = cc1101_obj[temp_id - 1];

    self->base.type = type;

    uint32_t freq;
    uint8_t sck, csn, mosi, miso;

