freshev/micropython/ports/esp32/modcc1101.c
    if(args[ARG_freq].u_int < 100000) freq = 100000;
    else if(args[ARG_freq].u_int > 80000000) freq = 80000000;
    else freq = args[ARG_freq].u_int;

    if(args[ARG_sck].u_int == -1) {
        switch (args[ARG_id].u_int) {
            case 1: sck = MICROPY_HW_SPI1_SCK; break;
            case 2: sck = MICROPY_HW_SPI2_SCK; break;
            default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown 'CC1101 SPI ID' argument value")); return mp_const_none;
        }
    } else sck = args[ARG_sck].u_int;

    if(args[ARG_csn].u_int == -1) {
        switch (args[ARG_id].u_int) {
            case 1: csn = MICROPY_HW_SPI1_CS; break;
            case 2: csn = -1; break;
            default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown 'CC1101 SPI ID' argument value")); return mp_const_none;
        }
    } else csn = args[ARG_csn].u_int;

    if(args[ARG_mosi].u_int == -1) {
        switch (args[ARG_id].u_int) {
            case 1: mosi = MICROPY_HW_SPI1_MOSI; break;
            case 2: mosi = MICROPY_HW_SPI2_MOSI; break;
            default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown 'CC1101 SPI ID' argument value")); return mp_const_none;
        }
    } else mosi = args[ARG_mosi].u_int;

    if(args[ARG_miso].u_int == -1) {
        switch (args[ARG_id].u_int) {
            case 1: miso = MICROPY_HW_SPI1_MISO; break;
            case 2: miso = MICROPY_HW_SPI2_MISO; break;
            default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown 'CC1101 SPI ID' argument value")); return mp_const_none;
        }
    } else miso = args[ARG_miso].u_int;


    switch (args[ARG_debug].u_int) {
        case 0: self->debug = 0; break;
        case 1: self->debug = 1; break;
        default: mp_raise_ValueError(MP_ERROR_TEXT("Unknown debug argument")); return mp_const_none;
    }

    self->freq = freq;
    self->sck = sck;
    self->csn = csn;
    self->mosi = mosi;
    self->miso = miso;

    self->MHz = 433.92;
    self->modulation = 2; // ASK
    self->chan = 0;
    self->ccmode = 0;
    self->power = 12; // dBm

    self->trxstate = 0;
    self->m4RxBw = 0;
    self->m4DaRa = 0;
    self->m1FEC = 0;
    self->m1PRE = 0;
    self->m1CHSP = 0;
    self->pc0WDATA = 0;
    self->pc0PktForm = 0;
    self->pc0CRC_EN = 0;
    self->pc0LenConf = 0;
    self->pc1PQT = 0;
    self->pc1CRC_AF = 0;
    self->pc1APP_ST = 0;
    self->pc1ADRCHK = 0;

    for(int i = 0 ; i < sizeof(P_INIT); i++) self->P_TABLE[i] = P_INIT[i];
    self->clb1[0] = 24; self->clb1[1] = 28;
    self->clb2[0] = 31; self->clb2[1] = 38;
    self->clb3[0] = 65; self->clb3[1] = 76;
    self->clb4[0] = 77; self->clb4[1] = 79;

    _cc1101_debug(self, "CC1101 object created");

    return MP_OBJ_FROM_PTR(self);
}

// ------------------
// CC1101 Open & Close
// ------------------

static mp_obj_t cc1101_open(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;

    _cc1101_init_internal(
        self,
        self->host,
        self->freq,
        0, // polarity
        0, // phase
        8, // bits
        MICROPY_PY_MACHINE_SPI_MSB, // firstbit
        self->sck,
        self->csn,
        self->mosi,
        self->miso);

    _cc1101_debug(self, "CC1101 inited");

    _cc1101_reset(self);
    _cc1101_reg_config_settings(self);

    return mp_const_none;
}

static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_open_obj, &cc1101_open);

static mp_obj_t cc1101_close(mp_obj_t self_in) {
    cc1101_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->state == cc1101_STATE_INIT) {
        _cc1101_deinit_internal(self);
        _cc1101_debug(self, "CC1101 closed");
    } else mp_printf(&mp_plat_print, "CC1101 already closed");
    return mp_const_none;
}

static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_close_obj, &cc1101_close);


// ----------------
// CC1101 SPI Read
// ----------------
uint8_t _cc1101_read(mp_obj_t self_in,  uint8_t m_addr) {
    cc1101_obj_t * self = self_in;
    if (self->state == cc1101_STATE_INIT) {
        _cc1101_debug(self, "SPI%d read at 0x%02X", self->host, m_addr);
        byte rbyte = _spi_transfer_addr(self, m_addr, 0); // The written value is ignored, reg value is read
        _cc1101_debug(self, "SPI%d read at 0x%02X -> 0x%02X", self->host, m_addr, rbyte);
        return rbyte;
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}
static mp_obj_t cc1101_read(mp_obj_t self_in,  mp_obj_t addr) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr);
    return mp_obj_new_int(_cc1101_read(self, m_addr));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_read_obj, &cc1101_read);



static mp_obj_t cc1101_read_burst(mp_obj_t self_in, mp_obj_t addr, mp_obj_t length) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr);
    uint32_t m_length = mp_obj_get_int(length);

    vstr_t vstr;
    vstr_init_len(&vstr, m_length);

    if (self->state == cc1101_STATE_INIT) {
        uint8_t * m_write_buffer = malloc(m_length);
        if(m_write_buffer != NULL) {
             memset(m_write_buffer, 0, m_length);
            _cc1101_debug(self, "SPI%d read at 0x%02X 0x%02X bytes", self->host, m_addr, m_length);
            _spi_transfer_addr_burst(self, m_addr, m_write_buffer, (uint8_t*)vstr.buf, m_length);
            free(m_write_buffer);
            //return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
            //return mp_obj_new_str_from_vstr(&vstr);
            return mp_obj_new_bytes_from_vstr(&vstr);
        } else mp_raise_CC1101Error(CC1101_MALLOC_FAILED);
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_read_burst_obj, &cc1101_read_burst);


// ---------
// SPI Write
// ---------
uint8_t _cc1101_write(mp_obj_t self_in, uint8_t m_addr, uint8_t m_wbyte) {
    cc1101_obj_t * self = self_in;
    if (self->state == cc1101_STATE_INIT) {
        _cc1101_debug(self, "SPI%d write at 0x%02X: 0x%02X", self->host, m_addr, m_wbyte);
        uint8_t rbyte = _spi_transfer_addr(self, m_addr, m_wbyte);
        return rbyte;
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}

static mp_obj_t cc1101_write(mp_obj_t self_in, mp_obj_t addr, mp_obj_t wbyte) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr);
    uint8_t m_wbyte = mp_obj_get_int(wbyte);
    return mp_obj_new_int(_cc1101_write(self, m_addr, m_wbyte));
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_write_obj, &cc1101_write);


void _cc1101_write_burst(mp_obj_t self_in, uint8_t w_addr, uint8_t* m_write_buffer, uint32_t m_length) {
    cc1101_obj_t * self = self_in;
    if (self->state == cc1101_STATE_INIT) {
        uint8_t * m_read_buffer = malloc(m_length);
        if(m_read_buffer != NULL) {
            _cc1101_debug(self, "SPI%d write at 0x%02X 0x%02X bytes", self->host, w_addr, m_length);
            _spi_transfer_addr_burst(self, w_addr, (uint8_t *)m_write_buffer, m_read_buffer, m_length);
            free(m_read_buffer);
        } else mp_raise_CC1101Error(CC1101_MALLOC_FAILED);
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}
static mp_obj_t cc1101_write_burst(mp_obj_t self_in, mp_obj_t addr, mp_obj_t wbuffer) {
    cc1101_obj_t * self = self_in;
    uint8_t w_addr = mp_obj_get_int(addr);

    mp_buffer_info_t m_write_buffer;
    mp_get_buffer_raise(wbuffer, &m_write_buffer, MP_BUFFER_READ);
    uint32_t m_length = m_write_buffer.len;
    _cc1101_write_burst(self, w_addr, (uint8_t *)m_write_buffer.buf, m_length);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_write_burst_obj, &cc1101_write_burst);


