freshev/micropython/ports/esp32/modcc1101.c
uint8_t _cc1101_command(mp_obj_t self_in, uint8_t m_wbyte) {
    cc1101_obj_t * self = self_in;
    if (self->state == cc1101_STATE_INIT) {
        byte rbyte = _spi_transfer(self, m_wbyte);
        _cc1101_debug(self, "SPI%d command 0x%02X -> 0x%02X", self->host, m_wbyte, rbyte);
        return rbyte;
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}
static mp_obj_t cc1101_command(mp_obj_t self_in, mp_obj_t wbyte) {
    cc1101_obj_t * self = self_in;
    uint8_t m_wbyte = mp_obj_get_int(wbyte);
    return mp_obj_new_int(_cc1101_command(self, m_wbyte));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_command_obj, &cc1101_command);


static mp_obj_t cc1101_strobe(mp_obj_t self_in, mp_obj_t wbyte) {
    cc1101_obj_t * self = self_in;
    uint8_t m_wbyte = mp_obj_get_int(wbyte);
    return mp_obj_new_int(_cc1101_command(self, m_wbyte));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_strobe_obj, &cc1101_strobe);

static mp_obj_t cc1101_flush(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;

    if (self->state == cc1101_STATE_INIT) {
        // Dumb
        _cc1101_debug(self, "SPI%d flush FIFO buffers", self->host);
        return mp_const_none;
    } else mp_raise_CC1101Error(CC1101_NOT_OPENED);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_flush_obj, &cc1101_flush);


// ------------
// CC1101 Print
// ------------

void cc1101_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    cc1101_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "SPI%u(freq=%u, polarity=%u, phase=%u, bits=%u, firstbit=%u, sck=%d, csn=%d, mosi=%d, miso=%d) : %s",
        self->host, self->freq, self->polarity,
        self->phase, self->bits, self->firstbit,
        self->sck, self->csn, self->mosi, self->miso,
        self->state == cc1101_STATE_INIT ? "inited" : "closed");
}

// ---------------
// CC1101 specific
// ---------------

// byte SpiReadStatus(byte addr);
uint8_t _cc1101_spi_read_status(mp_obj_t self_in, uint8_t addr) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = addr | READ_BURST;
    byte rbyte = _cc1101_read(self,  m_addr);
    _cc1101_debug(self, "CC1101 read status at 0x%02X: 0x%02X", addr, rbyte);
    return rbyte;
}
static mp_obj_t cc1101_spi_read_status(mp_obj_t self_in, mp_obj_t addr) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr);
    return mp_obj_new_int(_cc1101_spi_read_status(self,  m_addr));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_spi_read_status_obj, &cc1101_spi_read_status);


// void SpiWriteReg(byte addr, byte value);
static mp_obj_t cc1101_spi_write_reg(mp_obj_t self_in, mp_obj_t addr, mp_obj_t value) {
    cc1101_obj_t * self = self_in;
    cc1101_write(self, addr, value);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_spi_write_reg_obj, &cc1101_spi_write_reg);

// void SpiWriteBurstReg(byte addr, byte *buffer, byte num);
static mp_obj_t cc1101_spi_write_burst_reg(mp_obj_t self_in, mp_obj_t addr, mp_obj_t wbuffer) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr) | WRITE_BURST;
    cc1101_write_burst(self, mp_obj_new_int(m_addr), wbuffer);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_spi_write_burst_reg_obj, &cc1101_spi_write_burst_reg);

// byte SpiReadReg(byte addr);
static mp_obj_t cc1101_spi_read_reg(mp_obj_t self_in, mp_obj_t addr) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr) | READ_SINGLE;
    return cc1101_read(self, mp_obj_new_int(m_addr));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_spi_read_reg_obj, &cc1101_spi_read_reg);

// void SpiReadBurstReg(byte addr, byte *buffer, byte num);
static mp_obj_t cc1101_spi_read_burst_reg(mp_obj_t self_in, mp_obj_t addr, mp_obj_t num) {
    cc1101_obj_t * self = self_in;
    uint8_t m_addr = mp_obj_get_int(addr) | READ_BURST;
    return cc1101_read_burst(self, mp_obj_new_int(m_addr), num);
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_spi_read_burst_reg_obj, &cc1101_spi_read_burst_reg);


// void setPA(int p);
static mp_obj_t cc1101_set_pa(mp_obj_t self_in, mp_obj_t p_in) {
    cc1101_obj_t * self = self_in;
    int8_t m_p = mp_obj_get_int(p_in);

    int p = 0;
    self->power = m_p;
    _cc1101_debug(self, "CC1101 set_pa(%d)", self->power);

    if (self->MHz >= 300 && self->MHz <= 348) {
        if (m_p <= -30)                   p = P_TABLE_315[0];
        else if (m_p > -30 && m_p <= -20) p = P_TABLE_315[1];
        else if (m_p > -20 && m_p <= -15) p = P_TABLE_315[2];
        else if (m_p > -15 && m_p <= -10) p = P_TABLE_315[3];
        else if (m_p > -10 && m_p <= 0)   p = P_TABLE_315[4];
        else if (m_p > 0   && m_p <= 5)   p = P_TABLE_315[5];
        else if (m_p > 5   && m_p <= 7)   p = P_TABLE_315[6];
        else if (m_p > 7)                 p = P_TABLE_315[7];
        self->last_power = 1;
    }
    else if (self->MHz >= 378 && self->MHz <= 464) {
        if (m_p <= -30)                   p = P_TABLE_433[0];
        else if (m_p > -30 && m_p <= -20) p = P_TABLE_433[1];
        else if (m_p > -20 && m_p <= -15) p = P_TABLE_433[2];
        else if (m_p > -15 && m_p <= -10) p = P_TABLE_433[3];
        else if (m_p > -10 && m_p <= 0)   p = P_TABLE_433[4];
        else if (m_p > 0   && m_p <= 5)   p = P_TABLE_433[5];
        else if (m_p > 5   && m_p <= 7)   p = P_TABLE_433[6];
        else if (m_p > 7)                 p = P_TABLE_433[7];
        self->last_power = 2;
    }
    else if (self->MHz >= 779 && self->MHz <= 899.99) {
        if (m_p <= -30)                   p = P_TABLE_868[0];
        else if (m_p > -30 && m_p <= -20) p = P_TABLE_868[1];
        else if (m_p > -20 && m_p <= -15) p = P_TABLE_868[2];
        else if (m_p > -15 && m_p <= -10) p = P_TABLE_868[3];
        else if (m_p > -10 && m_p <= -6)  p = P_TABLE_868[4];
        else if (m_p > -6  && m_p <= 0)   p = P_TABLE_868[5];
        else if (m_p > 0   && m_p <= 5)   p = P_TABLE_868[6];
        else if (m_p > 5   && m_p <= 7)   p = P_TABLE_868[7];
        else if (m_p > 7   && m_p <= 10)  p = P_TABLE_868[8];
        else if (m_p > 10)                p = P_TABLE_868[9];
        self->last_power = 3;
    }
    else if (self->MHz >= 900 && self->MHz <= 928) {
        if (m_p <= -30)                   p = P_TABLE_915[0];
        else if (m_p > -30 && m_p <= -20) p = P_TABLE_915[1];
        else if (m_p > -20 && m_p <= -15) p = P_TABLE_915[2];
        else if (m_p > -15 && m_p <= -10) p = P_TABLE_915[3];
        else if (m_p > -10 && m_p <= -6)  p = P_TABLE_915[4];
        else if (m_p > -6  && m_p <= 0)   p = P_TABLE_915[5];
        else if (m_p > 0   && m_p <= 5)   p = P_TABLE_915[6];
        else if (m_p > 5   && m_p <= 7)   p = P_TABLE_915[7];
        else if (m_p > 7   && m_p <= 10)  p = P_TABLE_915[8];
        else if (m_p > 10)                p = P_TABLE_915[9];
        self->last_power = 4;
    }
    if (self->modulation == 2) {
       self->P_TABLE[0] = 0;
       self->P_TABLE[1] = p;
    } else {
       self->P_TABLE[0] = p;
       self->P_TABLE[1] = 0;
    }
    _cc1101_write_burst(self, CC1101_PATABLE, self->P_TABLE, sizeof(self->P_TABLE));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_pa_obj, &cc1101_set_pa);


// void setModulation(byte m);
static mp_obj_t cc1101_set_modulation(mp_obj_t self_in, mp_obj_t modulation) {
    cc1101_obj_t * self = MP_OBJ_TO_PTR(self_in);
    uint8_t m_modulation = mp_obj_get_int(modulation);
    if (m_modulation > 4) m_modulation = 4;
    self->modulation = m_modulation;
    uint8_t frend0 = 0x10;
    _cc1101_debug(self, "CC1101 set_modulation(%d)", self->modulation);

