freshev/micropython/ports/esp32/modcc1101.c
    _cc1101_split_MDMCFG2(self);
    switch (m_modulation) {
        case 0: self->m2MODFM = 0x00; frend0 = 0x10; break; // 2-FSK
        case 1: self->m2MODFM = 0x10; frend0 = 0x10; break; // GFSK
        case 2: self->m2MODFM = 0x30; frend0 = 0x11; break; // ASK
        case 3: self->m2MODFM = 0x40; frend0 = 0x10; break; // 4-FSK
        case 4: self->m2MODFM = 0x70; frend0 = 0x10; break; // MSK
    }
    _cc1101_write(self, CC1101_MDMCFG2, self->m2DCOFF + self->m2MODFM + self->m2MANCH + self->m2SYNCM);
    _cc1101_write(self, CC1101_FREND0,  frend0);
    cc1101_set_pa(self, mp_obj_new_int(self->power));

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_modulation_obj, &cc1101_set_modulation);


// void setCCMode(bool s);
static mp_obj_t cc1101_set_cc_mode(mp_obj_t self_in, mp_obj_t mode) {
    cc1101_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint8_t m_mode = mp_obj_get_int(mode);
    self->ccmode = m_mode;
    _cc1101_debug(self, "CC1101 set_cc_mode(%d)", self->ccmode);
    if(self->ccmode == 1) {
       _cc1101_write(self, CC1101_IOCFG2,   0x0B);
       _cc1101_write(self, CC1101_IOCFG0,   0x06);
       _cc1101_write(self, CC1101_PKTCTRL0, 0x05);
       _cc1101_write(self, CC1101_MDMCFG3,  0xF8);
       _cc1101_write(self, CC1101_MDMCFG4,  11 + self->m4RxBw);
    } else {
       _cc1101_write(self, CC1101_IOCFG2,   0x0D);
       _cc1101_write(self, CC1101_IOCFG0,   0x0D);
       _cc1101_write(self, CC1101_PKTCTRL0, 0x32);
       _cc1101_write(self, CC1101_MDMCFG3,  0x93);
       _cc1101_write(self, CC1101_MDMCFG4,  7 + self->m4RxBw);
    }
    cc1101_set_modulation(self, mp_obj_new_int(self->modulation));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_cc_mode_obj, &cc1101_set_cc_mode);


// void setMHZ(float mhz);
static mp_obj_t cc1101_set_mhz(mp_obj_t self_in, mp_obj_t mhz_in) {
    cc1101_obj_t * self = self_in;
    uint8_t freq2 = 0;
    uint8_t freq1 = 0;
    uint32_t freq0 = 0;
    float mhz = mp_obj_get_float(mhz_in);

    self->MHz = mhz;

    while(1) {
        if (mhz >= 26) {
            mhz -= 26;
            freq2 += 1;
        }
        else if (mhz >= 0.1015625) {
            mhz -= 0.1015625;
            freq1 += 1;
        }
        else if (mhz >= 0.00039675) {
            mhz -= 0.00039675;
            freq0 += 1;
        }
        else break;
    }
    if (freq0 > 255) {
        freq1 += 1;
        freq0 -= 256;
    }

    _cc1101_write(self, CC1101_FREQ2, freq2);
    _cc1101_write(self, CC1101_FREQ1, freq1);
    _cc1101_write(self, CC1101_FREQ0, freq0);

    _cc1101_calibrate(self);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_mhz_obj, &cc1101_set_mhz);

// void getMHZ(float mhz);
static mp_obj_t cc1101_get_mhz(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    uint8_t freq2 = _cc1101_read(self, CC1101_FREQ2 | READ_SINGLE);
    uint8_t freq1 = _cc1101_read(self, CC1101_FREQ1 | READ_SINGLE);
    uint8_t freq0 = _cc1101_read(self, CC1101_FREQ0 | READ_SINGLE);
    float mhz = 26 * freq2 + 26/256.0 * freq1 + 26/256.0/256.0 * freq0;
    self->MHz = mhz;

    return mp_obj_new_float(mhz);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_mhz_obj, &cc1101_get_mhz);


void _cc1101_calibrate(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 calibrate()");
    if (self->MHz >= 300 && self->MHz <= 348) {
        _cc1101_write(self, CC1101_FSCTRL0, _cc1101_map(self->MHz, 300, 348, self->clb1[0], self->clb1[1]));
        if (self->MHz < 322.88) _cc1101_write(self, CC1101_TEST0, 0x0B);
        else {
            _cc1101_write(self, CC1101_TEST0, 0x09);
            int s = _cc1101_spi_read_status(self, CC1101_FSCAL2);
            if (s < 32) _cc1101_write(self, CC1101_FSCAL2, s + 32);
            if (self->last_power != 1) cc1101_set_pa(self, mp_obj_new_int(self->power));
        }
    }
    else if (self->MHz >= 378 && self->MHz <= 464) {
        _cc1101_write(self, CC1101_FSCTRL0, _cc1101_map(self->MHz, 378, 464, self->clb2[0], self->clb2[1]));
        if (self->MHz < 430.5) _cc1101_write(self, CC1101_TEST0, 0x0B);
        else {
            _cc1101_write(self, CC1101_TEST0, 0x09);
            int s = _cc1101_spi_read_status(self, CC1101_FSCAL2);
            if (s < 32) _cc1101_write(self, CC1101_FSCAL2, s + 32);
            if (self->last_power != 2) cc1101_set_pa(self, mp_obj_new_int(self->power));
        }
    }
    else if (self->MHz >= 779 && self->MHz <= 899.99) {
        _cc1101_write(self, CC1101_FSCTRL0, _cc1101_map(self->MHz, 779, 899, self->clb3[0], self->clb3[1]));
        if (self->MHz < 861) _cc1101_write(self, CC1101_TEST0,0x0B);
        else {
            _cc1101_write(self, CC1101_TEST0,0x09);
            int s = _cc1101_spi_read_status(self, CC1101_FSCAL2);
            if (s < 32) _cc1101_write(self, CC1101_FSCAL2, s + 32);
            if (self->last_power != 3) cc1101_set_pa(self, mp_obj_new_int(self->power));
        }
    }
    else if (self->MHz >= 900 && self->MHz <= 928) {
        _cc1101_write(self, CC1101_FSCTRL0, _cc1101_map(self->MHz, 900, 928, self->clb4[0], self->clb4[1]));
        _cc1101_write(self, CC1101_TEST0, 0x09);
        int s = _cc1101_spi_read_status(self, CC1101_FSCAL2);
        if (s < 32) _cc1101_write(self, CC1101_FSCAL2, s+32);
        if (self->last_power != 4) cc1101_set_pa(self, mp_obj_new_int(self->power));
    }
}


// void setChannel(byte chnl);
static mp_obj_t cc1101_set_channel(mp_obj_t self_in, mp_obj_t chan) {
    cc1101_obj_t * self = self_in;
    uint8_t m_chan = mp_obj_get_int(chan);
    self->chan = m_chan;
    _cc1101_debug(self, "CC1101 set_channel(%d)", self->chan);
    _cc1101_write(self, CC1101_CHANNR, self->chan);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_channel_obj, &cc1101_set_channel);

// void getChannel(byte chnl);
static mp_obj_t cc1101_get_channel(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    uint8_t m_chan = _cc1101_read(self, CC1101_CHANNR | READ_SINGLE);
    self->chan = m_chan;
    return mp_obj_new_int(self->chan);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_channel_obj, &cc1101_get_channel);

