freshev/micropython/ports/esp32/modcc1101.c
// void setChsp(float f);
static mp_obj_t cc1101_set_chsp(mp_obj_t self_in, mp_obj_t f_in) {
    cc1101_obj_t * self = self_in;
    float f = mp_obj_get_float(f_in);

    _cc1101_debug(self, "CC1101 set_chsp(%f)", f);

    _cc1101_split_MDMCFG1(self);
    uint8_t MDMCFG0 = 0;
    self->m1CHSP = 0;
    if (f > 405.456543) f = 405.456543;
    if (f < 25.390625) f = 25.390625;
    for (int i = 0; i < 5; i++) {
        if (f <= 50.682068) {
            f -= 25.390625;
            f /= 0.0991825;
            MDMCFG0 = f;
            float s1 = (f - MDMCFG0) *10;
            if (s1 >= 5)MDMCFG0++;
            i = 5;
        } else {
            self->m1CHSP++;
            f /= 2;
        }
    }
    _cc1101_write(self, CC1101_MDMCFG1, self->m1CHSP + self->m1FEC + self->m1PRE);
    _cc1101_write(self, CC1101_MDMCFG0, MDMCFG0);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_chsp_obj, &cc1101_set_chsp);

// void setRxBW(float f);
static mp_obj_t cc1101_set_rx_bw(mp_obj_t self_in, mp_obj_t f_in) {
    cc1101_obj_t * self = self_in;
    float f = mp_obj_get_float(f_in);

    _cc1101_debug(self, "CC1101 set_rxbw(%f)", f);

    _cc1101_split_MDMCFG4(self);
    int s1 = 3;
    int s2 = 3;
    for (int i = 0; i < 3; i++) {
        if (f > 101.5625) { f /= 2; s1--; }
        else i=3;
    }
    for (int i = 0; i < 3; i++) {
        if (f > 58.1) { f /= 1.25; s2--; }
        else i=3;
    }
    s1 *= 64;
    s2 *= 16;
    self->m4RxBw = s1 + s2;
    _cc1101_write(self, CC1101_MDMCFG4, self->m4RxBw + self->m4DaRa);

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_rx_bw_obj, &cc1101_set_rx_bw);

// void setDRate(float d);
static mp_obj_t cc1101_set_d_rate(mp_obj_t self_in, mp_obj_t d_in) {
    cc1101_obj_t * self = self_in;
    float d = mp_obj_get_float(d_in);

    _cc1101_split_MDMCFG4(self);
    uint8_t MDMCFG3 = 0;
    if (d > 1621.83) d = 1621.83;
    if (d < 0.0247955) d = 0.0247955;
    self->m4DaRa = 0;
    for (int i = 0; i<20; i++) {
        if (d <= 0.0494942) {
            d = d - 0.0247955;
            d = d / 0.00009685;
            MDMCFG3 = d;
            float s1 = (d - MDMCFG3) * 10;
            if (s1 >= 5) MDMCFG3++;
            i = 20;
        } else {
            self->m4DaRa++;
            d = d / 2;
        }
    }
    _cc1101_write(self, CC1101_MDMCFG4,  self->m4RxBw + self->m4DaRa);
    _cc1101_write(self, CC1101_MDMCFG3,  MDMCFG3);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_d_rate_obj, &cc1101_set_d_rate);

// void setDeviation(float d);
static mp_obj_t cc1101_set_deviation(mp_obj_t self_in, mp_obj_t d_in) {
    cc1101_obj_t * self = self_in;
    float d = mp_obj_get_float(d_in);

    _cc1101_debug(self, "CC1101 set_deviation(%f)", d);

    float f = 1.586914;
    float v = 0.19836425;
    int c = 0;
    if (d > 380.859375) d = 380.859375;
    if (d < 1.586914) d = 1.586914;
    for (int i = 0; i < 255; i++) {
        f += v;
        if (c == 7) {
            v *= 2;
            c =- 1;
            i += 8;
        }
        if (f >= d) {
            c = i;
            i = 255;
        }
        c++;
    }
    _cc1101_write(self, CC1101_DEVIATN, c);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_deviation_obj, &cc1101_set_deviation);

// void SetTx(void);
static mp_obj_t cc1101_set_tx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_tx()");
    _cc1101_command(self, CC1101_SIDLE);
    _cc1101_command(self, CC1101_STX);
    self->trxstate = 1;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_tx_obj, &cc1101_set_tx);

// void SetRx(void);
static mp_obj_t cc1101_set_rx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_rx()");
    _cc1101_command(self, CC1101_SIDLE);
    _cc1101_command(self, CC1101_SRX);
    self->trxstate = 2;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_rx_obj, &cc1101_set_rx);

// void SetTx(float mhz);
static mp_obj_t cc1101_set_tx_freq(mp_obj_t self_in, mp_obj_t mhz) {
    cc1101_obj_t * self = self_in;
    float f = mp_obj_get_float(mhz);
    _cc1101_debug(self, "CC1101 set_tx_freq(%f)", f);
    _cc1101_command(self, CC1101_SIDLE);
    cc1101_set_mhz(self, mhz);
    _cc1101_command(self, CC1101_STX);
    self->trxstate = 1;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_tx_freq_obj, &cc1101_set_tx_freq);

// void SetRx(float mhz);
static mp_obj_t cc1101_set_rx_freq(mp_obj_t self_in, mp_obj_t mhz) {
    cc1101_obj_t * self = self_in;
    float f = mp_obj_get_float(mhz);
    _cc1101_debug(self, "CC1101 set_rx_freq(%f)", f);
    _cc1101_command(self, CC1101_SIDLE);
    cc1101_set_mhz(self, mhz);
    _cc1101_command(self, CC1101_SRX);
    self->trxstate = 2;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_rx_freq_obj, &cc1101_set_rx_freq);


// int getRssi(void);
static mp_obj_t cc1101_get_rssi(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    int rssi;
    _cc1101_debug(self, "CC1101 get_rssi()");
    rssi = _cc1101_spi_read_status(self, CC1101_RSSI);
    if (rssi >= 128) rssi = (rssi - 256) / 2 - 74;
    else rssi = (rssi / 2) - 74;
    return mp_obj_new_int(rssi);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_rssi_obj, &cc1101_get_rssi);


// byte getLqi(void);
static mp_obj_t cc1101_get_lqi(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 get_lqi()");
    uint8_t lqi = _cc1101_spi_read_status(self, CC1101_LQI);
    return mp_obj_new_int(lqi);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_lqi_obj, &cc1101_get_lqi);


// void setSres(void);
static mp_obj_t cc1101_set_sres(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_sres()");
    _cc1101_command(self, CC1101_SRES);
    self->trxstate = 0;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_sres_obj, &cc1101_set_sres);

// Enable and calibrate frequency synthesizer
static mp_obj_t cc1101_set_sfs_tx_on(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_sfs_tx_on()");
    _cc1101_command(self, CC1101_SFSTXON);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_sfs_tx_on_obj, &cc1101_set_sfs_tx_on);

// Turn off crystal oscillator
static mp_obj_t cc1101_set_sx_off(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_sx_off()");
    _cc1101_command(self, CC1101_SXOFF);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_sx_off_obj, &cc1101_set_sx_off);

// Calibrate frequency synthesizer and turn it off
static mp_obj_t cc1101_set_scal(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_scal()");
    _cc1101_command(self, CC1101_SCAL);
    vTaskDelay(1); // About 10 ms
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_scal_obj, &cc1101_set_scal);

// Enable RX
static mp_obj_t cc1101_set_srx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_srx()");
    _cc1101_command(self, CC1101_SRX);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_srx_obj, &cc1101_set_srx);

// Enable TX
static mp_obj_t cc1101_set_stx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_stx()");
    _cc1101_command(self, CC1101_STX);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_stx_obj, &cc1101_set_stx);

// Ends RX and/or TX, turn off frequency synthesizer and exit
static mp_obj_t cc1101_set_sidle(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 set_sidle()");
    _cc1101_command(self, CC1101_SIDLE);
    self->trxstate = 0;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_set_sidle_obj, &cc1101_set_sidle);

// Flush RX FIFO buffer
static mp_obj_t cc1101_flush_rx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 flush_rx()");
    _cc1101_command(self, CC1101_SFRX);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_flush_rx_obj, &cc1101_flush_rx);

