freshev/micropython/ports/esp32/modcc1101.c
// Flush TX FIFO buffer
static mp_obj_t cc1101_flush_tx(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 flush_tx()");
    _cc1101_command(self, CC1101_SFTX);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_flush_tx_obj, &cc1101_flush_tx);


// void goSleep(void);
static mp_obj_t cc1101_go_sleep(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 go_sleep()");
    _cc1101_command(self, CC1101_SIDLE);
    _cc1101_command(self, CC1101_SPWD);
    self->trxstate = 0;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_go_sleep_obj, &cc1101_go_sleep);

// void SendData(byte *txBuffer, byte size);
static mp_obj_t cc1101_send_data(mp_obj_t self_in, mp_obj_t wbuffer, mp_obj_t timeout) {
    cc1101_obj_t * self = self_in;
    uint32_t m_timeout = mp_obj_get_int(timeout);
    _cc1101_debug(self, "CC1101 send_data()");

    mp_buffer_info_t m_write_buffer;
    mp_get_buffer_raise(wbuffer, &m_write_buffer, MP_BUFFER_READ);
    uint32_t m_length = m_write_buffer.len;
    _cc1101_write(self, CC1101_TXFIFO, m_length);
    mp_hal_delay_us(10); // was 5, do not touch !!!!
    _cc1101_write_burst(self, CC1101_TXFIFO | WRITE_BURST, (uint8_t *)m_write_buffer.buf, m_length);

    _cc1101_command(self, CC1101_SIDLE); // 0x36
    _cc1101_command(self, CC1101_STX);   // 0x35

    if(m_timeout == 0) {
        while(!_cc1101_digital_read_gdo0(self)); // Wait for GDO0 to be set -> sync transmitted
        while(_cc1101_digital_read_gdo0(self));  // Wait for GDO0 to be cleared -> end of packet
    } else {
       if(m_timeout / portTICK_PERIOD_MS == 0) vTaskDelay(1);
       else vTaskDelay(m_timeout / portTICK_PERIOD_MS);
    }

    _cc1101_command(self, CC1101_SFTX);
    self->trxstate = 1;
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_send_data_obj, &cc1101_send_data);

// byte CheckReceiveFlag(void);
static mp_obj_t cc1101_check_receive_flag(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    if (self->trxstate != 2) cc1101_set_rx(self);
    if (_cc1101_digital_read_gdo0(self)) {
        while (_cc1101_digital_read_gdo0(self)); // No delay
        return mp_obj_new_int(1);
    }
    else {
        return mp_obj_new_int(0);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_check_receive_flag_obj, &cc1101_check_receive_flag);

// byte ReceiveData(byte *rxBuffer);
static mp_obj_t cc1101_receive_data(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;

    if(_cc1101_spi_read_status(self, CC1101_RXBYTES) & BYTES_IN_RXFIFO)
    {
        uint8_t size = _cc1101_read(self, CC1101_RXFIFO | READ_SINGLE);
        mp_hal_delay_us(5); // do not touch !!!

        mp_obj_t rxbuffer = cc1101_read_burst(self, mp_obj_new_int(CC1101_RXFIFO | READ_BURST), mp_obj_new_int(size));

        mp_obj_t status = cc1101_read_burst(self, mp_obj_new_int(CC1101_RXFIFO | READ_BURST), mp_obj_new_int(2));
        uint8_t m_status[2];
        memset(m_status, 0, sizeof(m_status));
        mp_buffer_info_t m_status_buffer;
        mp_get_buffer_raise(status, &m_status_buffer, MP_BUFFER_READ);
        if (m_status_buffer.len == 2) {
            m_status[0] = *((uint8_t*)m_status_buffer.buf);
            m_status[1] = *((uint8_t*)m_status_buffer.buf + 1);
            _cc1101_debug(self, "CC1101 receive_data() -> 0x%02X, 0x%02X", m_status[0], m_status[1]);
        }

        _cc1101_command(self, CC1101_SFRX);
        _cc1101_command(self, CC1101_SRX);
        return rxbuffer;
    } else {
        _cc1101_command(self, CC1101_SFRX);
        _cc1101_command(self, CC1101_SRX);
        vstr_t vstr;
        vstr_init_len(&vstr, 0);
        _cc1101_debug(self, "CC1101 receive_data() -> NODATA");
        //return mp_obj_new_str_from_vstr(&mp_type_bytes, &vstr);
        //return mp_obj_new_str_from_vstr(&vstr);
        return mp_obj_new_bytes_from_vstr(&vstr);
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_receive_data_obj, &cc1101_receive_data);


// bool CheckCRC(void);
static mp_obj_t cc1101_check_crc(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    uint8_t lqi = _cc1101_spi_read_status(self, CC1101_LQI);
    uint8_t crc_ok = (lqi & 0x80) >> 7;
    if (crc_ok == 1) {
         _cc1101_debug(self, "CC1101 check_crc() -> 0x01");
         return mp_obj_new_int(1);
    } else {
        _cc1101_debug(self, "CC1101 check_crc() -> 0x00");
        _cc1101_command(self, CC1101_SFRX);
        _cc1101_command(self, CC1101_SRX);
        return mp_obj_new_int(0);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_check_crc_obj, &cc1101_check_crc);

// void setClb(byte b, byte s, byte e);
static mp_obj_t cc1101_set_clb(size_t n_args, const mp_obj_t *arg) {
    if (n_args != 4) {
        mp_raise_CC1101Error("4 arguments required");
    } else {
        cc1101_obj_t * self = MP_OBJ_TO_PTR(arg[0]);
        uint8_t b = mp_obj_get_int(arg[1]);
        uint8_t s = mp_obj_get_int(arg[2]);
        uint8_t e = mp_obj_get_int(arg[3]);
        _cc1101_debug(self, "CC1101 set_clb(0x%02X, 0x%02X, 0x%02X)", b, s, e);

        if (b == 1) {
            self->clb1[0] = s;
            self->clb1[1] = e;
        }
        else if (b == 2) {
            self->clb2[0] = s;
            self->clb2[1] = e;
        }
        else if (b == 3) {
            self->clb3[0] = s;
            self->clb3[1] = e;
        }
        else if (b == 4) {
            self->clb4[0] = s;
            self->clb4[1] = e;
        }
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(cc1101_set_clb_obj, 4, 4, &cc1101_set_clb);

// bool getCC1101(void);
static mp_obj_t cc1101_get_cc1101(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 get_cc1101()");
    uint8_t status = _cc1101_spi_read_status(self, CC1101_VERSION);
    if (status != 0 && status != 0xFF) return mp_obj_new_int(1);
    else return mp_obj_new_int(0);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_cc1101_obj, &cc1101_get_cc1101);

// byte getMode(void);
static mp_obj_t cc1101_get_mode(mp_obj_t self_in) {
    cc1101_obj_t * self = self_in;
    _cc1101_debug(self, "CC1101 get_mode()");
    return mp_obj_new_int(self->trxstate);
}
static MP_DEFINE_CONST_FUN_OBJ_1(cc1101_get_mode_obj, &cc1101_get_mode);

