freshev/micropython/ports/esp32/modcc1101.c
// void setSyncWord(byte sh, byte sl);
static mp_obj_t cc1101_set_sync_word(mp_obj_t self_in, mp_obj_t sh, mp_obj_t sl) {
    cc1101_obj_t * self = self_in;
    uint8_t m_sh = mp_obj_get_int(sh);
    uint8_t m_sl = mp_obj_get_int(sl);
    _cc1101_debug(self, "CC1101 set_sync_word(0x%02X, 0x%02X)", m_sh, m_sl);
    _cc1101_write(self, CC1101_SYNC1, m_sh);
    _cc1101_write(self, CC1101_SYNC0, m_sl);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_set_sync_word_obj, &cc1101_set_sync_word);

// void setAddr(byte v);
static mp_obj_t cc1101_set_addr(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_addr(0x%02X)", m_v);
    _cc1101_write(self, CC1101_ADDR, m_v);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_addr_obj, &cc1101_set_addr);

// void setWhiteData(bool v);
static mp_obj_t cc1101_set_white_data(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_white_data(0x%02X)", m_v);
    _cc1101_split_PKTCTRL0(self);
    self->pc0WDATA = 0;
    if (m_v == 1) self->pc0WDATA = 64;
    _cc1101_write(self, CC1101_PKTCTRL0, self->pc0WDATA + self->pc0PktForm + self->pc0CRC_EN + self->pc0LenConf);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_white_data_obj, &cc1101_set_white_data);

// void setPktFormat(byte v);
static mp_obj_t cc1101_set_pkt_format(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_pkt_format(0x%02X)", m_v);
    _cc1101_split_PKTCTRL0(self);
    self->pc0PktForm = 0;
    if (m_v > 3) m_v = 3;
    self->pc0PktForm = m_v * 16;
    _cc1101_write(self, CC1101_PKTCTRL0, self->pc0WDATA + self->pc0PktForm + self->pc0CRC_EN + self->pc0LenConf);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_pkt_format_obj, &cc1101_set_pkt_format);

// void setCrc(bool v);
static mp_obj_t cc1101_set_crc(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_crc(0x%02X)", m_v);
    _cc1101_split_PKTCTRL0(self);
    self->pc0CRC_EN = 0;
    if (m_v == 1) self->pc0CRC_EN = 4;
    _cc1101_write(self, CC1101_PKTCTRL0, self->pc0WDATA + self->pc0PktForm + self->pc0CRC_EN + self->pc0LenConf);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_crc_obj, &cc1101_set_crc);

// void setLengthConfig(byte v);
static mp_obj_t cc1101_set_length_config(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_length_config(0x%02X)", m_v);
    _cc1101_split_PKTCTRL0(self);
    self->pc0LenConf = 0;
    if (m_v > 3) m_v = 3;
    self->pc0LenConf = m_v;
    _cc1101_write(self, CC1101_PKTCTRL0, self->pc0WDATA + self->pc0PktForm + self->pc0CRC_EN + self->pc0LenConf);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_length_config_obj, &cc1101_set_length_config);

// void setPacketLength(byte v);
static mp_obj_t cc1101_set_packet_length(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_packet_length(0x%02X)", m_v);
    _cc1101_write(self, CC1101_PKTLEN, m_v);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_packet_length_obj, &cc1101_set_packet_length);

// void setDcFilterOff(bool v);
static mp_obj_t cc1101_set_dc_filter_off(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_dc_filter_off(0x%02X)", m_v);
    _cc1101_split_MDMCFG2(self);
    self->m2DCOFF = 0;
    if (m_v == 1) self->m2DCOFF = 128;
    _cc1101_write(self, CC1101_MDMCFG2, self->m2DCOFF + self->m2MODFM + self->m2MANCH + self->m2SYNCM);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_dc_filter_off_obj, &cc1101_set_dc_filter_off);

// void setManchester(bool v);
static mp_obj_t cc1101_set_manchester(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_manchester(0x%02X)", m_v);
    _cc1101_split_MDMCFG2(self);
    self->m2MANCH = 0;
    if (m_v == 1) self->m2MANCH = 8;
    _cc1101_write(self, CC1101_MDMCFG2, self->m2DCOFF + self->m2MODFM + self->m2MANCH + self->m2SYNCM);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_manchester_obj, &cc1101_set_manchester);

// void setSyncMode(byte v);
static mp_obj_t cc1101_set_sync_mode(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_sync_mode(0x%02X)", m_v);
    _cc1101_split_MDMCFG2(self);
    self->m2SYNCM = 0;
    if (m_v > 7) m_v = 7;
    self->m2SYNCM = m_v;
    _cc1101_write(self, CC1101_MDMCFG2, self->m2DCOFF + self->m2MODFM + self->m2MANCH + self->m2SYNCM);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_sync_mode_obj, &cc1101_set_sync_mode);

// void setFEC(bool v);
static mp_obj_t cc1101_set_fec(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_fec(0x%02X)", m_v);
    _cc1101_split_MDMCFG1(self);
    self->m1FEC = 0;
    if (m_v == 1) self->m1FEC = 128;
    _cc1101_write(self, CC1101_MDMCFG1, self-> m1FEC + self->m1PRE + self->m1CHSP);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_fec_obj, &cc1101_set_fec);

// void setPRE(byte v);
static mp_obj_t cc1101_set_pre(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_pre(0x%02X)", m_v);
    _cc1101_split_MDMCFG1(self);
    self->m1PRE = 0;
    if (m_v > 7) m_v = 7;
    self->m1PRE = m_v * 16;
    _cc1101_write(self, CC1101_MDMCFG1, self->m1FEC + self->m1PRE + self->m1CHSP);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_pre_obj, &cc1101_set_pre);

