freshev/micropython/ports/esp32/modcc1101.c
// void setPQT(byte v);
static mp_obj_t cc1101_set_pqt(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_pqt(0x%02X)", m_v);
    _cc1101_split_PKTCTRL1(self);
    self->pc1PQT = 0;
    if (m_v > 7) m_v = 7;
    self->pc1PQT = m_v * 32;
    _cc1101_write(self, CC1101_PKTCTRL1, self->pc1PQT + self->pc1CRC_AF + self->pc1APP_ST + self->pc1ADRCHK);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_pqt_obj, &cc1101_set_pqt);

// void setCRC_AF(bool v);
static mp_obj_t cc1101_set_crc_af(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_crc_af(0x%02X)", m_v);
    _cc1101_split_PKTCTRL1(self);
    self->pc1CRC_AF = 0;
    if (m_v == 1) self->pc1CRC_AF = 8;
    _cc1101_write(self, CC1101_PKTCTRL1, self->pc1PQT + self->pc1CRC_AF + self->pc1APP_ST + self->pc1ADRCHK);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_crc_af_obj, &cc1101_set_crc_af);

// void setAppendStatus(bool v);
static mp_obj_t cc1101_set_append_status(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_append_status(0x%02X)", m_v);
    _cc1101_split_PKTCTRL1(self);
    self->pc1APP_ST = 0;
    if (m_v == 1) self->pc1APP_ST = 4;
    _cc1101_write(self, CC1101_PKTCTRL1, self->pc1PQT + self->pc1CRC_AF + self->pc1APP_ST + self->pc1ADRCHK);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_append_status_obj, &cc1101_set_append_status);

// void setAdrChk(byte v);
static mp_obj_t cc1101_set_adr_chk(mp_obj_t self_in, mp_obj_t v) {
    cc1101_obj_t * self = self_in;
    uint8_t m_v = mp_obj_get_int(v);
    _cc1101_debug(self, "CC1101 set_adr_chk(0x%02X)", m_v);
    _cc1101_split_PKTCTRL1(self);
    self->pc1ADRCHK = 0;
    if (m_v > 3) m_v = 3;
    self->pc1ADRCHK = m_v;
    _cc1101_write(self, CC1101_PKTCTRL1, self->pc1PQT + self->pc1CRC_AF + self->pc1APP_ST + self->pc1ADRCHK);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_set_adr_chk_obj, &cc1101_set_adr_chk);

// uint8_t CheckRxFifo(int t);
static mp_obj_t cc1101_check_rx_fifo(mp_obj_t self_in, mp_obj_t t) {
    cc1101_obj_t * self = self_in;
    uint8_t m_t = mp_obj_get_int(t);
    if (self->trxstate != 2) cc1101_set_rx(self);
    if (_cc1101_spi_read_status(self, CC1101_RXBYTES) & BYTES_IN_RXFIFO) {
        _cc1101_debug(self, "CC1101 check_rx_fifo(0x%02X) -> 0x01", m_t);
        if(m_t / portTICK_PERIOD_MS == 0) vTaskDelay(1); // About 10 ms
        else vTaskDelay(m_t / portTICK_PERIOD_MS);
        return mp_obj_new_int(1);
    } else {
        _cc1101_debug(self, "CC1101 check_rx_fifo(0x%02X) -> 0x00", m_t);
        return mp_obj_new_int(0);
    }
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_check_rx_fifo_obj, &cc1101_check_rx_fifo);



static mp_obj_t cc1101_crc8(mp_obj_t self_in, mp_obj_t data, mp_obj_t polynome) {
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(data, &bufinfo, MP_BUFFER_READ);
    uint8_t poly = mp_obj_get_int(polynome);

    uint8_t crc = 0;
    for (size_t i = 0; i < bufinfo.len; i++) {
        uint8_t bt = ((uint8_t *)bufinfo.buf)[i];
        crc ^= bt;
        for (int j = 0; j < 8; j++) {
            if ((crc & 0x80) != 0)
                crc = (uint8_t)((crc << 1) ^ poly);
            else
                crc <<= 1;
        }
    }
    return MP_OBJ_NEW_SMALL_INT(crc);
}
static MP_DEFINE_CONST_FUN_OBJ_3(cc1101_crc8_obj, &cc1101_crc8);


static mp_obj_t cc1101_ba2hex(mp_obj_t self_in, mp_obj_t data) {
    char mess[1024];
    memset(mess, 0, sizeof(mess));

    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(data, &bufinfo, MP_BUFFER_READ);
    uint32_t length = 0;
    for(int i = 0; i < bufinfo.len;i++) {
        if(length + 4 < sizeof(mess)) {
            length += snprintf(mess + length, sizeof(mess) - length, "%02X ", *((uint8_t*)bufinfo.buf + i));
        }
    }
    if(length > 0 && length < sizeof(mess)) mess[length - 1] = 0; // trim last space
    return mp_obj_new_str(mess, strlen(mess));
}
static MP_DEFINE_CONST_FUN_OBJ_2(cc1101_ba2hex_obj, &cc1101_ba2hex);


// ---------
// Internals
// ---------


void _cc1101_reset(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 reset()");
    _cc1101_command(self, CC1101_SRES);
}
void _cc1101_reg_config_settings(cc1101_obj_t * self) {

    _cc1101_debug(self, "CC1101 reg_config_settings()");
    _cc1101_write(self, CC1101_FSCTRL1,  0x06);

    cc1101_set_cc_mode(self, mp_obj_new_int(self->ccmode));
    cc1101_set_mhz(self, mp_obj_new_float(self->MHz));

    _cc1101_write(self, CC1101_MDMCFG1,  0x02);
    _cc1101_write(self, CC1101_MDMCFG0,  0xF8);
    _cc1101_write(self, CC1101_CHANNR,   self->chan);
    _cc1101_write(self, CC1101_DEVIATN,  0x47);
    _cc1101_write(self, CC1101_FREND1,   0x56);
    _cc1101_write(self, CC1101_MCSM0 ,   0x18);
    _cc1101_write(self, CC1101_FOCCFG,   0x16);
    _cc1101_write(self, CC1101_BSCFG,    0x1C);
    _cc1101_write(self, CC1101_AGCCTRL2, 0xC7);
    _cc1101_write(self, CC1101_AGCCTRL1, 0x00);
    _cc1101_write(self, CC1101_AGCCTRL0, 0xB2);
    _cc1101_write(self, CC1101_FSCAL3,   0xE9);
    _cc1101_write(self, CC1101_FSCAL2,   0x2A);
    _cc1101_write(self, CC1101_FSCAL1,   0x00);
    _cc1101_write(self, CC1101_FSCAL0,   0x1F);
    _cc1101_write(self, CC1101_FSTEST,   0x59);
    _cc1101_write(self, CC1101_TEST2,    0x81);
    _cc1101_write(self, CC1101_TEST1,    0x35);
    _cc1101_write(self, CC1101_TEST0,    0x09);
    _cc1101_write(self, CC1101_PKTCTRL1, 0x04);
    _cc1101_write(self, CC1101_ADDR,     0x00);
    _cc1101_write(self, CC1101_PKTLEN,   0x00);
}

void _cc1101_split_PKTCTRL0(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 split_PKTCTRL0");
    int calc = _cc1101_spi_read_status(self, CC1101_PKTCTRL0);
    self->pc0WDATA = 0;
    self->pc0PktForm = 0;
    self->pc0CRC_EN = 0;
    self->pc0LenConf = 0;
    while(1) {
        if (calc >= 64) {
            calc -= 64;
            self->pc0WDATA += 64;
        }
        else if (calc >= 16) {
            calc -= 16;
            self->pc0PktForm += 16;
        }
        else if (calc >= 4) {
            calc -= 4;
            self->pc0CRC_EN += 4;
        }
        else {
            self->pc0LenConf = calc;
            break;
        }
    }
}

void _cc1101_split_PKTCTRL1(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 split_PKTCTRL1");
    int calc = _cc1101_spi_read_status(self, CC1101_PKTCTRL1);
    self->pc1PQT = 0;
    self->pc1CRC_AF = 0;
    self->pc1APP_ST = 0;
    self->pc1ADRCHK = 0;
    while(1) {
        if (calc >= 32) {
            calc -= 32;
            self->pc1PQT += 32;
        }
        else if (calc >= 8) {
            calc -= 8;
            self->pc1CRC_AF += 8;
        }
        else if (calc >= 4) {
            calc -= 4;
            self->pc1APP_ST += 4;
        }
        else {
            self->pc1ADRCHK = calc;
            break;
        }
    }
}
void _cc1101_split_MDMCFG1(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 split_MDMCFG1");
    int calc = _cc1101_spi_read_status(self, CC1101_MDMCFG1);
    self->m1FEC = 0;
    self->m1PRE = 0;
    self->m1CHSP = 0;
    while(1) {
        if (calc >= 128) {
           calc -= 128;
           self->m1FEC += 128;
        }
        else if (calc >= 16) {
           calc -= 16;
           self->m1PRE += 16;
        }
        else {
           self->m1CHSP = calc;
           break;
        }
    }
}
void _cc1101_split_MDMCFG2(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 split_MDMCFG2");
    int calc = _cc1101_spi_read_status(self, CC1101_MDMCFG2);
    self->m2DCOFF = 0;
    self->m2MODFM = 0;
    self->m2MANCH = 0;
    self->m2SYNCM = 0;
    while(1) {
        if (calc >= 128) {
            calc -= 128;
            self->m2DCOFF += 128;
        }
        else if (calc >= 16) {
            calc -= 16;
            self->m2MODFM += 16;
        }
        else if (calc >= 8) {
            calc -= 8;
            self->m2MANCH += 8;
        }
        else {
            self->m2SYNCM = calc;
            break;
        }
    }
}

void _cc1101_split_MDMCFG4(cc1101_obj_t * self) {
    _cc1101_debug(self, "CC1101 split_MDMCFG4");
    int calc = _cc1101_spi_read_status(self, CC1101_MDMCFG4);
    self->m4RxBw = 0;
    self->m4DaRa = 0;
    while(1) {
        if (calc >= 64) {
            calc -= 64;
            self->m4RxBw += 64;
        }
        else if (calc >= 16) {
            calc -= 16;
            self->m4RxBw += 16;
        }
        else {
            self->m4DaRa = calc;
            break;
        }
    }
}

uint8_t _cc1101_digital_read_gdo0(cc1101_obj_t * self) {
    int rbyte =_cc1101_spi_read_status(self, CC1101_PKTSTATUS) & 0x01;
    _cc1101_debug(self, "CC1101 read_gdo0() -> 0x%02X", rbyte);
    return rbyte;
}

void _cc1101_debug(cc1101_obj_t * self, char * message, ...) {
    char mess[1024];
    if(self->debug == 1) {
        memset(mess, 0, sizeof(mess));
        va_list args;
        va_start(args, message);
        vsnprintf(mess, sizeof(mess), message, args);
        va_end(args);
        mp_printf(&mp_plat_print, "%s\n", mess);
    }
}

