freshev/micropython/ports/esp32/modcc1101.c
uint8_t _cc1101_map(uint32_t x, uint32_t in_min, uint32_t in_max, uint32_t out_min, uint32_t out_max)
{
  return (uint8_t)((x - in_min) * (out_max - out_min) / ((float)(in_max - in_min)) + out_min);
}




// -------
// Locals
// -------

static const mp_rom_map_elem_t cc1101_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_open), MP_ROM_PTR(&cc1101_open_obj) },
    //{ MP_ROM_QSTR(MP_QSTR___del__), MP_ROM_PTR(&cc1101__del__obj) },
    { MP_ROM_QSTR(MP_QSTR_close), MP_ROM_PTR(&cc1101_close_obj) },
    { MP_ROM_QSTR(MP_QSTR_read), MP_ROM_PTR(&cc1101_read_obj) },
    { MP_ROM_QSTR(MP_QSTR_read_burst), MP_ROM_PTR(&cc1101_read_burst_obj) },
    { MP_ROM_QSTR(MP_QSTR_write), MP_ROM_PTR(&cc1101_write_obj) },
    { MP_ROM_QSTR(MP_QSTR_write_burst), MP_ROM_PTR(&cc1101_write_burst_obj) },
    { MP_ROM_QSTR(MP_QSTR_strobe), MP_ROM_PTR(&cc1101_strobe_obj) }, // alias for "command"
    { MP_ROM_QSTR(MP_QSTR_command), MP_ROM_PTR(&cc1101_command_obj) },
    { MP_ROM_QSTR(MP_QSTR_flush), MP_ROM_PTR(&cc1101_flush_obj) },

    { MP_ROM_QSTR(MP_QSTR_spi_read_status), MP_ROM_PTR(&cc1101_spi_read_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_spi_write_reg), MP_ROM_PTR(&cc1101_spi_write_reg_obj) },
    { MP_ROM_QSTR(MP_QSTR_spi_write_burst_reg), MP_ROM_PTR(&cc1101_spi_write_burst_reg_obj) },
    { MP_ROM_QSTR(MP_QSTR_spi_read_reg), MP_ROM_PTR(&cc1101_spi_read_reg_obj) },
    { MP_ROM_QSTR(MP_QSTR_spi_read_burst_reg), MP_ROM_PTR(&cc1101_spi_read_burst_reg_obj) },

    { MP_ROM_QSTR(MP_QSTR_set_cc_mode), MP_ROM_PTR(&cc1101_set_cc_mode_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_modulation), MP_ROM_PTR(&cc1101_set_modulation_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_pa), MP_ROM_PTR(&cc1101_set_pa_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_mhz), MP_ROM_PTR(&cc1101_set_mhz_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_mhz), MP_ROM_PTR(&cc1101_get_mhz_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_channel), MP_ROM_PTR(&cc1101_set_channel_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_channel), MP_ROM_PTR(&cc1101_get_channel_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_chsp), MP_ROM_PTR(&cc1101_set_chsp_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_rx_bw), MP_ROM_PTR(&cc1101_set_rx_bw_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_d_rate), MP_ROM_PTR(&cc1101_set_d_rate_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_deviation), MP_ROM_PTR(&cc1101_set_deviation_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_tx), MP_ROM_PTR(&cc1101_set_tx_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_rx), MP_ROM_PTR(&cc1101_set_rx_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_tx_freq), MP_ROM_PTR(&cc1101_set_tx_freq_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_rx_freq), MP_ROM_PTR(&cc1101_set_rx_freq_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_rssi), MP_ROM_PTR(&cc1101_get_rssi_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_lqi), MP_ROM_PTR(&cc1101_get_lqi_obj) },

    { MP_ROM_QSTR(MP_QSTR_set_sres), MP_ROM_PTR(&cc1101_set_sres_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_sfs_tx_on), MP_ROM_PTR(&cc1101_set_sfs_tx_on_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_sx_off), MP_ROM_PTR(&cc1101_set_sx_off_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_scal), MP_ROM_PTR(&cc1101_set_scal_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_srx), MP_ROM_PTR(&cc1101_set_srx_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_stx), MP_ROM_PTR(&cc1101_set_stx_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_sidle), MP_ROM_PTR(&cc1101_set_sidle_obj) },
    { MP_ROM_QSTR(MP_QSTR_flush_rx), MP_ROM_PTR(&cc1101_flush_rx_obj) },
    { MP_ROM_QSTR(MP_QSTR_flush_tx), MP_ROM_PTR(&cc1101_flush_tx_obj) },
    { MP_ROM_QSTR(MP_QSTR_go_sleep), MP_ROM_PTR(&cc1101_go_sleep_obj) },

    { MP_ROM_QSTR(MP_QSTR_send_data), MP_ROM_PTR(&cc1101_send_data_obj) },
    { MP_ROM_QSTR(MP_QSTR_check_receive_flag), MP_ROM_PTR(&cc1101_check_receive_flag_obj) },
    { MP_ROM_QSTR(MP_QSTR_receive_data), MP_ROM_PTR(&cc1101_receive_data_obj) },
    { MP_ROM_QSTR(MP_QSTR_check_crc), MP_ROM_PTR(&cc1101_check_crc_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_clb), MP_ROM_PTR(&cc1101_set_clb_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_cc1101), MP_ROM_PTR(&cc1101_get_cc1101_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_mode), MP_ROM_PTR(&cc1101_get_mode_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_sync_word), MP_ROM_PTR(&cc1101_set_sync_word_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_addr), MP_ROM_PTR(&cc1101_set_addr_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_white_data), MP_ROM_PTR(&cc1101_set_white_data_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_pkt_format), MP_ROM_PTR(&cc1101_set_pkt_format_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_crc), MP_ROM_PTR(&cc1101_set_crc_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_length_config), MP_ROM_PTR(&cc1101_set_length_config_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_packet_length), MP_ROM_PTR(&cc1101_set_packet_length_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_dc_filter_off), MP_ROM_PTR(&cc1101_set_dc_filter_off_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_manchester), MP_ROM_PTR(&cc1101_set_manchester_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_sync_mode), MP_ROM_PTR(&cc1101_set_sync_mode_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_fec), MP_ROM_PTR(&cc1101_set_fec_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_pre), MP_ROM_PTR(&cc1101_set_pre_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_pqt), MP_ROM_PTR(&cc1101_set_pqt_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_crc_af), MP_ROM_PTR(&cc1101_set_crc_af_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_append_status), MP_ROM_PTR(&cc1101_set_append_status_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_adr_chk), MP_ROM_PTR(&cc1101_set_adr_chk_obj) },
    { MP_ROM_QSTR(MP_QSTR_check_rx_fifo), MP_ROM_PTR(&cc1101_check_rx_fifo_obj) },
    { MP_ROM_QSTR(MP_QSTR_crc8), MP_ROM_PTR(&cc1101_crc8_obj) },
    { MP_ROM_QSTR(MP_QSTR_ba2hex), MP_ROM_PTR(&cc1101_ba2hex_obj) },
};

static MP_DEFINE_CONST_DICT(cc1101_locals_dict, cc1101_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    cc1101_type,
    MP_QSTR_CC1101,
    MP_TYPE_FLAG_NONE,
    make_new, cc1101_make_new,
    print, cc1101_print,
    locals_dict, &cc1101_locals_dict
    );

// -------
// Modules
// -------

static const mp_map_elem_t mp_module_cc1101_globals_table[] = {
    { MP_OBJ_NEW_QSTR(MP_QSTR___name__), MP_OBJ_NEW_QSTR(MP_QSTR_cc1101) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_cc1101), (mp_obj_t)MP_ROM_PTR(&cc1101_type) },
};

static MP_DEFINE_CONST_DICT(mp_module_cc1101_globals, mp_module_cc1101_globals_table);

const mp_obj_module_t mp_module_cc1101 = {
    .base = { &mp_type_module },
    .globals = (mp_obj_dict_t*)&mp_module_cc1101_globals,
};

MP_REGISTER_MODULE(MP_QSTR__cc1101, mp_module_cc1101);

